Tekla.Structures.ModelInternal.dotBooleanPart_t
Boolean part serialization structure.

Tekla.Structures.ModelInternal.dotBooleanPart_t.Boolean
Base class

Tekla.Structures.ModelInternal.dotBooleanPart_t.Type
BooleanTypeEnum

Tekla.Structures.ModelInternal.dotBooleanPart_t.OperativePart
Cutting/Adding part